# Вывод текущего времени
# Вывод текущего времени

import datetime
d = (datetime.datetime.today().strftime("%H:%M"))
a = d.split(":")
b = int(a[0])
c = int(a[1])

# словарь для часов, когда ровно 0 минут
h1 = {0:"Ровно двеннадцать часов", 1:"Ровно один час", 2:"Ровно два часа", 3:"Ровно три часа", 4:"Ровно четыре часа", 5:"Ровно пять часов", 
6:"Ровно шесть часов", 7:"Ровно семь часов", 8:"Ровно восемь часов", 9:"Ровно девять часов", 10:"Ровно десять часов", 11:"Ровно одиннадцать часов", 
12:"Ровно двеннадцать часов", 13:"Ровно один час", 14:"Ровно два часа", 15:"Ровно три часа", 16:"Ровно четыре часа", 17:"Ровно пять часов", 
18:"Ровно шесть часов", 19:"Ровно семь часов", 20:"Ровно восемь часов", 21:"Ровно девять часов", 22:"Ровно десять часов", 23:"Ровно одиннадцать часов", 
24:"Ровно двеннадцать часов"}

# словарь для часов, когда минут от 1 до 39
h2 = {0:"двеннадцатого", 1:"первого", 2:"второго", 3:"третьего", 4:"четвертого", 5:"пятого", 6:"шестого", 7:"седьмого", 8:"восьмого", 9:"девятого", 
10:"десятого", 11:"одиннадцатого", 12:"двеннадцатого", 13:"первого", 14:"второго", 15:"третьего", 16:"четвертого", 17:"пятого", 18:"шестого", 
19:"седьмого", 20:"восьмого", 21:"девятого", 22:"десятого", 23:"одиннадцатого", 24:"двеннадцатого"}

# словарь для часов, когда минут от 40 до 59
h3 = {0:"двеннадцать", 1:"час", 2:"два", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 
12:"двеннадцать", 13:"час", 14:"два", 15:"три", 16:"четыре", 17:"пять", 18:"шесть", 19:"семь", 20:"восемь", 21:"девять", 22:"десять", 
23:"одиннадцать", 24:"двеннадцать"}

# словарь для минут от 1 до 59
m = {1:"Одна минута ", 2:"Две минуты ", 3:"Три минуты ", 4:"Четыре минуты ", 5:"Пять минут ", 6:"Шесть минут ", 7:"Семь минут ", 
8:"Восемь минут ", 9:"Девять минут ", 10:"Десять минут ", 11:"Одиннадцать минут ", 12:"Двеннадцать минут ", 13:"Триннадцать минут ", 
14:"Четырнадцать минут ", 15:"Пятнадцать минут ", 16:"Шестнадцать минут ", 17:"Семнадцать минут ", 18:"Восемнадцать минут ", 
19:"Девятнадцать минут ", 20:"Двадцать минут ", 21:"Двадцать одна минута ", 22:"Двадцать две минуты ", 23:"Двадцать три минуты ", 
24:"Двадцать четыре минуты ", 25:"Двадцать пять минут ", 26:"Двадцать шесть минут ", 27:"Двадцать семь минут ", 28:"Двадцать восемь минут ",
29:"Двадцать девять минут ", 30: "Половина ", 31:"Тридцать одна минута ", 32:"Тридцать две минуты ", 33:"Тридцать три минуты ", 
34:"Тридцать четыре минуты ", 35:"Тридцать пять минут ", 36:"Тридцать шесть минут ", 37:"Тридцать семь минут ", 38:"Тридцать восемь минут ", 
39:"Тридцать девять минут ", 40: "Без двадцати минут ", 41: "Без девятнадцати минут ", 42: "Без восемнадцати минут ", 43: "Без семнадцати минут ", 
44: "Без шестандцати минут ", 45: "Без пятнадцати минут ", 46: "Без четырнадцати минут ", 47: "Без триннадцати минут ", 48: "Без двеннадцати минут ", 
49: "Без одиннадцати минут ", 50: "Без десяти минут ", 51: "Без девяти минут ", 52: "Без восьми минут ", 53: "Без семи минут ", 54: "Без шести минут ", 
55: "Без пяти минут ", 56: "Без четырёх минут ", 57: "Без трёх минут ", 58: "Без двух минут ", 59: "Без одной минуты "}


for key1 in h1:
    if b == key1 and c == 0:
        print(h1[key1])

for key2 in h2:
    for key_m in m:
        if b == key2 and c == key_m and 0 < c <= 39:
            print(m[key_m] + h2[key2+1])

for key3 in h3:
    for key_m in m:
        if b == key3 and c == key_m and 40 <= c <= 59:
            print(m[key_m] + h3[key3+1])

# Вывод времени, введенного с консоли

time = input("Введите время в следующем формате -> часы : минуты: \n")
z = time.replace(" ", "")
z = time.split(":")
x = int(z[0])
y = int(z[1])

if x < 0 or x > 24 or y < 0 or y > 59:
    print("Неверный формат времени!")

for key1 in h1:
    if x == key1 and y == 0:
        print(h1[key1])
for key2 in h2:
    for key_m in m:
        if x == key2 and y == key_m and 0 < y <= 39:
            print(m[key_m] + h2[key2+1])
for key3 in h3:
    for key_m in m:
        if x == key3 and y == key_m and 40 <= y <= 59:
            print(m[key_m] + h3[key3+1])