#Обычный вывод времени

import datetime
time = (datetime.datetime.now().strftime("%H:%M"))
a = time.split(":")
b = int(a[0])
c = int(a[1])

#Словари

#БД на 1-59

d0 = {1:"Одна минута ", 2:"Две минуты ", 3:"Три минуты ", 4:"Четыре минуты ", 5:"Пять минут ", 6:"Шесть минут ", 7:"Семь минут ", 
8:"Восемь минут ", 9:"Девять минут ", 10:"Десять минут ", 11:"Одиннадцать минут ", 12:"Двенадцать минут ", 13:"Тринадцать минут ", 
14:"Четырнадцать минут ", 15:"Пятнадцать минут ", 16:"Шестнадцать минут ", 17:"Семнадцать минут ", 18:"Восемнадцать минут ", 
19:"Девятнадцать минут ", 20:"Двадцать минут ", 21:"Двадцать одна минута ", 22:"Двадцать две минуты ", 23:"Двадцать три минуты ", 
24:"Двадцать четыре минуты ", 25:"Двадцать пять минут ", 26:"Двадцать шесть минут ", 27:"Двадцать семь минут ", 28:"Двадцать восемь минут ",
29:"Двадцать девять минут ", 30: "Половина ", 31:"Тридцать одна минута ", 32:"Тридцать две минуты ", 33:"Тридцать три минуты ", 
34:"Тридцать четыре минуты ", 35:"Тридцать пять минут ", 36:"Тридцать шесть минут ", 37:"Тридцать семь минут ", 38:"Тридцать восемь минут ", 
39:"Тридцать девять минут ", 40: "Без двадцати минут ", 41: "Без девятнадцати минут ", 42: "Без восемнадцати минут ", 43: "Без семнадцати минут ", 
44: "Без шестнадцати минут ", 45: "Без пятнадцати минут ", 46: "Без четырнадцати минут ", 47: "Без тринадцати минут ", 48: "Без двенадцати минут ", 
49: "Без одиннадцати минут ", 50: "Без десяти минут ", 51: "Без девяти минут ", 52: "Без восьми минут ", 53: "Без семи минут ", 54: "Без шести минут ", 
55: "Без пяти минут ", 56: "Без четырёх минут ", 57: "Без трёх минут ", 58: "Без двух минут ", 59: "Без одной минуты "}

#1-39 минут

d1 = {0:"двенадцатого", 1:"первого", 2:"второго", 3:"третьего", 4:"четвертого", 5:"пятого", 6:"шестого", 7:"седьмого", 8:"восьмого", 9:"девятого", 
10:"десятого", 11:"одиннадцатого", 12:"двенадцатого", 13:"первого", 14:"второго", 15:"третьего", 16:"четвертого", 17:"пятого", 18:"шестого", 
19:"седьмого", 20:"восьмого", 21:"девятого", 22:"десятого", 23:"одиннадцатого", 24:"двенадцатого"}

#40-59 минут

d2 = {0:"двенадцать", 1:"первого", 2:"два", 3:"три", 4:"четыре", 5:"пять", 6:"шесть", 7:"семь", 8:"восемь", 9:"девять", 10:"десять", 11:"одиннадцать", 
12:"двенадцать", 13:"первого", 14:"два", 15:"три", 16:"четыре", 17:"пять", 18:"шесть", 19:"семь", 20:"восемь", 21:"девять", 22:"десять", 23:"одиннадцать", 24:"двенадцать"}

#0 минут

d3 = {0:"Полночь", 1:"Ровно час ночи", 2:"Ровно два часа ночи", 3:"Ровно три часа ночи", 4:"Ровно четыре часа ночи", 5:"Ровно пять часов утра", 
6:"Ровно шесть часов утра", 7:"Ровно семь часов утра", 8:"Ровно восемь часов утра", 9:"Ровно девять часов утра", 10:"Ровно десять часов утра", 11:"Ровно одиннадцать часов утра", 
12:"Полдень", 13:"Ровно час дня", 14:"Ровно два часа дня", 15:"Ровно три часа дня", 16:"Ровно четыре часа дня", 17:"Ровно пять часов вечера", 
18:"Ровно шесть часов вечера", 19:"Ровно семь часов вечера", 20:"Ровно восемь часов вечера", 21:"Ровно девять часов вечера", 22:"Ровно десять часов вечера", 23:"Ровно одиннадцать часов вечера"} 



#Сам вывод 

for key1 in d1:
    for key_d0 in d0:
        if b == key1 and c == key_d0 and 0 < c <= 39:
            print(d0[key_d0] + d1[key1])

for key2 in d2:
    for key_d0 in d0:
        if b == key2 and c == key_d0 and 40 <= c <= 59:
            print(d0[key_d0] + d2[key2+1])

for key3 in d3:
    if b == key3 and c == 0:
        print(d3[key3])

#Вывод того, что ввели через консоль

time = input("Введите время в формате: часы:минуты:\n")
a1 = time.split(":")
b1 = int(a1[0])
c1 = int(a1[1])

for key1 in d1:
    for key_d0 in d0:
        if b1 == key1 and c1 == key_d0 and 0 < c1 <= 39:
            print(d0[key_d0] + d1[key1])

for key2 in d2:
    for key_d0 in d0:
        if b1 == key2 and c1 == key_d0 and 40 <= c1 <= 59:
            print(d0[key_d0] + d1[key2+1])

for key3 in d3:
    if b1 == key3 and c1 == 0:
        print(d3[key3])

if b1 < 0 or b1 > 24 or c1 < 0 or c1 > 59:
    print("Неверный формат времени!")

