from datetime import  datetime

x = input("Введите время в формате 21:23 = ")
user_time=x.split(':')
h=int(user_time[0])
m=int(user_time[1])

dic_hour_r = {0: "двенадцать часов", 1: "час", 2: "два часа", 3: "три часа", 4: "четыречаса", 5: "пять часа",
 6: "шесть часов", 7: "семь часов", 
8: "восемь часов", 9: "девять часов", 10: "десять часов", 11: "одинадцать часов",
 12: "двенадцать часов", 13: "час", 14: "два часа", 15: "три часа",
 16: "четыре часа", 17: "пять часов", 18: "шесть часов", 19: "семь часов", 20: "восемь часов",
  21: "девять часов", 22: "десять часов", 23: "одинадцать часов"}

dic_hour_p = { 0: "первого", 1: "второго", 2: "третьего", 3: "четверого", 4: "пятого",
 5: "шестого", 6: "седьмого", 7: "восьмого", 8: "девятого", 9: "десятого", 10: "одинадцатого",
 11: "двенадцатого", 12: "первого", 13: "второго", 14: "третьего", 15: "четверого", 16: "пятого",
 17: "шестого", 18: "седьмого", 19: "восьмого", 20: "девятого", 21: "десятого", 22: "одинадцатого",
 23: "двенадцатого"}

dic_hour_ost = { 0: "час", 1: "два", 2: "три", 3: "четыре", 4: "пять", 5: "шесть", 6: "семь", 
7: "восемь", 8: "девять", 9: "десять", 10: "одинадцать", 11: "двенадцать", 12: "час", 13: "два",
 14: "три", 15: "четыре", 16: "пять", 17: "шесть", 18: "семь", 19: "восемь", 20: "девять", 21: "десять",
  22: "одинадцать", 23: "двенадцать"}

dic_min_p={0 : "Ровно", 1 : "Одна минута", 2 : "Две минуты", 3 : "Три минуты", 4 : "Четыре минуты",
5 : "Пять минут", 6 : "Шесть минут", 7 : "Семь минут", 8 : "Восемь минут", 9 : "Девять минут",
10 : "Десять минут", 11 : "Одиннадцать минут", 12 : "Двенадцать минут", 13 : "Тринадцать минут",
14 : "Четырнадцать минут", 15 : "Пятнадцать минут", 16 : "Шеснадцать минут", 17 : "Семнадцать минут",
18 : "Восемнадцать минут", 19 : "Девятнадцать минут", 20 : "Двадцать минут", 21 : "Двадцать одна минута",
22 : "Двадцать две минуты", 23 : "Двадцать три минуты", 24 : "Двадцать четыре минуты",
25 : "Двадцать пять минут", 26 : "Двадцать шесть минут", 27 : "Двадцать семь минут",
28 : "Двадцать восемь минут", 29 : "Двадцать девять минут", 30 : "Половина", 31 : "Тридцать одна минута",
32 : "Тридцать две минуты", 33 : "Тридцать трими нуты", 34 : "Тридцать четыре минуты",
35 : "Тридцать пять минут", 36 : "Тридцать шесть минут", 37 : "Тридцать семь минут",
38 : "Тридцать восемь минут", 39 : "Тридцать девять минут", 40 : "Без двадцати",
41 : "Без девятнадцати", 42 : "Без восемнадцати", 43 : "Без семнадцати", 44 : "Без шеснадцати",
45 : "Без пятнадцати", 46 : "Без четырнадцати", 47 : "Без тринадцати", 48 : "Без двенадцати",
49 : "Без одинадцати", 50 : "Без десяти", 51 : "Без девяти", 52 : "Без восьми", 53 : "Без семи",
54 : "Без шести", 55 : "Без пяти", 56 : "Без четырех", 57 : "Без трех", 58 : "Без двух", 59 : "Без одной"}




if (m==0 and h>=0 and h<=24):
    rezult=str(dic_min_p[m])+" "+str(dic_hour_r[h])

elif (m==30 and h>=0 and h<=24):
    rezult=str(dic_min_p[m])+" "+str(dic_hour_p[h])

elif (m>1 and m<=29 and h>=0 and h<=24):
    rezult=str(dic_min_p[m])+" "+str(dic_hour_p[h])

elif (m>31 and m<=39 and h>=0 and h<=24):
    rezult=str(dic_min_p[m])+" "+str(dic_hour_p[h])

elif (m>40 and m<=59 and h>=0 and h<=24):
    rezult=str(dic_min_p[m])+" "+str(dic_hour_ost[h])

else: 
    rezult="Неверный формат времени!"



print("Время введенное пользователям строчно :", rezult)


curr_sys= datetime.now().strftime("%H:%M")
print("Текущее время :", curr_sys)
curr_sys=curr_sys.split(':')
h_sys=int(curr_sys[0])
m_sys=int(curr_sys[1])



if (m_sys==0 and h_sys>=0 and h_sys<=24):
    rezult_sys=str(dic_min_p[m_sys])+" "+str(dic_hour_r[h_sys])

elif (m_sys==30 and h_sys>=0 and h_sys<=24):
    rezult_sys=str(dic_min_p[m_sys])+" "+str(dic_hour_p[h_sys])

elif (m_sys>1 and m_sys<=29 and h_sys>=0 and h_sys<=24):
    rezult_sys=str(dic_min_p[m_sys])+" "+str(dic_hour_p[h_sys])

elif (m_sys>31 and m_sys<=39 and h_sys>=0 and h_sys<=24):
    rezult_sys=str(dic_min_p[m_sys])+" "+str(dic_hour_p[h_sys])

elif (m_sys>40 and m_sys<=59 and h_sys>=0 and h_sys<=24):
    rezult_sys=str(dic_min_p[m_sys])+" "+str(dic_hour_ost[h_sys])

else: 
    rezult_sys="Неверный формат времени!"



print("Текущее время строчно :", rezult_sys)